[
  {
    "id": 9,
    "name": "Sheet Metal Part Bending Project",
    "organization": "Sable Metal Manufacturing",
    "description": "Developed an automated sheet metal bending program using INFORM II, achieving 100 parts in 3 hours (200% of target production rate).",
    "longDescription": "• Developed a sheet metal bending program using INFORM II programming language to execute 6 sequential bends on each part.\n• Structured the robotic program into three distinct phases: picking, bending, and stacking operations.\n• Implemented an adjustment table mechanism to reposition parts at optimal angles for subsequent bends, integrating the adjustment sequence directly into the bending program.\n• Optimized stacking operations with reduced robot speed to ensure precise part placement and prevent damage during stacking.\n• Balanced speed and precision to meet production targets of 50 parts per 4-hour cycle.\n• Achieved production output of 100 parts in 3 hours, doubling the target efficiency.",
    "stars": 4,
    "tags": ["inform-ii","robotics","manufacturing","automation","sheet-metal"],
    "stack": ["INFORM II","Robotics","Manufacturing","Automation"],
    "repo": null,
    "demo": null,
    "images": ["./assets/images/action.jpg", "./assets/images/adjustmenttable.jpg","./assets/images/layout.jpg","./assets/images/bend5.jpg","./assets/images/bend6.jpg"],
    "added": "2025-01-01",
    "dateRange": "Jan 2025 — Apr 2025"
  },
  {
    "id": 10,
    "name": "Parallel Linkage Limit Switch Design",
    "organization": "Sable Metal Manufacturing",
    "description": "Designed and fabricated a sheet metal limit switch using parallel linkage mechanics, resolving detection and geometric compatibility issues of previous models.",
    "longDescription": "• Designed a limit switch using parallel linkage mechanics in SolidWorks, fabricated from sheet metal.\n• Optimized material usage by implementing variable thicknesses to minimize waste while maintaining structural integrity.\n• Developed an in-house manufacturing solution that reduced production costs.\n• Addressed limitations of previous switch models, which failed to detect parts or were incompatible with larger part geometries.\n• Eliminated both detection failures and geometric compatibility issues with the new design.",
    "stars": 3,
    "tags": ["solidworks","sheet-metal","mechanical-design","manufacturing"],
    "stack": ["SolidWorks","Sheet Metal","Mechanical Design"],
    "repo": null,
    "demo": null,
    "images": ["./assets/images/leftside.jpg", "./assets/images/rightside.jpg", "./assets/images/drawing.jpg"],
    "added": "2025-01-01",
    "dateRange": "Mar 2025 — Apr 2025"
  },
  {
    "id": 7,
    "name": "2025 Not-A-Boring Competition",
    "organization": "WatDig",
    "description": "Engineered a micro-scale Tunnel Boring Machine (TBM) with VFD control system and dead-reckoning navigation, achieving 3rd place in the 2025 Not-A-Boring Competition.",
    "longDescription": "• Engineered a micro-scale Tunnel Boring Machine (TBM) for the 2025 Not-A-Boring Competition.\n• Developed a control system to regulate excavation rate by adjusting the powertrain motor through a Variable Frequency Drive (VFD), ensuring optimal propulsion and excavation efficiency.\n• Programmed control software to manage motor speed, output torque, and current draw via the VFD interface.\n• Implemented a robust dead-reckoning-based navigation algorithm in Python for precise TBM positioning and path control.\n• Designed motor, gearbox, and associated couplings in Onshape to withstand the 2200 Nm torque requirement.\n• Utilized rapid prototyping to fabricate enclosures and mounts for above and below ground PCB control stations.\n• Developed an advanced muck removal system incorporating a venturi pump to effectively dampen and discharge soil during excavation.\n• Achieved 3rd place in the competition.",
    "stars": 5,
    "tags": ["tbm","vfd","python","onshape","competition","robotics"],
    "stack": ["Python","Onshape","VFD","Electronics","Rapid Prototyping"],
    "repo": null,
    "demo": null,
    "images": ["./assets/images/TBM.jpg", "./assets/images/ground.jpg", "./assets/images/team.jpg"],
    "added": "2025-01-01",
    "dateRange": "May 2024 — Apr 2025"
  },
  {
    "id": 8,
    "name": "Custom Programming Language",
    "organization": "Personal",
    "description": "Developed a Python-based interpreter for stack-based programs with a compiler that parses opcodes and generates p-code for execution.",
    "longDescription": "• Developed a Python interpreter to execute stack-based programs, supporting primarily arithmetic operations.\n• Designed and implemented a compiler that parses opcodes (PUSH, POP, etc.) and generates p-code for program execution.",
    "stars": 4,
    "tags": ["python","interpreter","compiler","programming-language"],
    "stack": ["Python","Compiler Design","Interpreter"],
    "repo": "https://github.com/yashpatel1314/NewLanguage",
    "demo": null,
    "images": [],
    "added": "2025-01-01",
    "dateRange": "Sept 2024 — Oct 2024"
  },
  {
    "id": 1,
    "name": "2024 Not-A-Boring-Competition Navigation Challenge",
    "organization": "WatDig",
    "description": "1st place winning autonomous navigation system featuring React GUI, SLAM-based localization, and probabilistic path planning with 94% route accuracy.",
    "longDescription": "• Developed a comprehensive autonomous navigation system for the Not-A-Boring Competition held in Austin, Texas.\n• Built a React-based GUI that subscribes to ROS2 nodes and displays real-time data from published sources.\n• Implemented a SLAM-based localization system using Python and Ultra WideBand (UWB) technology.\n• Programmed a probabilistic roadmap (PRM) algorithm to generate optimal routes with 94% accuracy.\n• Designed mechanical subsystem using 1/8-inch aluminum plates with machined axles and wheels.\n• Fabricated custom holders for batteries, UWB modules, and motor drivers.\n• Integrated electrical subsystem including emergency stop functionality, 4 lithium batteries, and 3 motor drivers.\n• Achieved 1st place victory at the competition.",
    "stars": 5,
    "tags": ["react","ros2","slam","uwb","navigation","competition","award-winning"],
    "stack": ["React","ROS2","Python","UWB","SLAM","PRM"],
    "repo": "https://github.com/yashpatel1314/gui_interface",
    "demo": null,
    "images": ["./assets/images/roverinside.jpg", "./assets/images/roveroutside.jpg", "./assets/images/navaward.jpg"],
    "added": "2024-10-01",
    "dateRange": "Oct 2024 — Apr 2024"
  },
  {
    "id": 5,
    "name": "Kettle Handle",
    "organization": "Welbilt",
    "description": "Designed and fabricated a mild steel safety handle for industrial kettles using Autodesk Inventor, currently deployed in manufacturing operations.",
    "longDescription": "• Designed and fabricated a mild steel kettle handle as a safety measure for industrial kettle operations.\n• Engineered the safety handle to prevent injuries from cart pushing and protect against kettle damage.\n• Created detailed assembly drawings using Autodesk Inventor.\n• Solution is currently in active use at the manufacturing facility.",
    "stars": 3,
    "tags": ["inventor","safety","manufacturing"],
    "stack": ["Autodesk Inventor","Mild Steel","Manufacturing"],
    "repo": null,
    "demo": null,
    "images": ["./assets/images/kettle1.png", "./assets/images/kettle2.png"],
    "added": "2023-04-01",
    "dateRange": "Jan 2023 — Apr 2023"
  },
  {
    "id": 6,
    "name": "Tool Stand",
    "organization": "Welbilt",
    "description": "Designed and fabricated a tool stand from mild steel and sheet metal to improve ergonomics and eliminate unsafe ground-level tool storage.",
    "longDescription": "• Designed and fabricated a tool stand from mild steel and sheet metal for safe measuring tool storage.\n• Engineered the stand to eliminate dangerous ground-level tool storage practices.\n• Improved ergonomics to prevent back injuries from repetitive bending during tool retrieval.\n• Utilized mild steel and sheet metal construction for enhanced durability.\n• Solution is currently in active use at the manufacturing facility.",
    "stars": 3,
    "tags": ["inventor","safety","sheet-metal"],
    "stack": ["Autodesk Inventor","Mild Steel","Sheet Metal"],
    "repo": null,
    "demo": null,
    "images": ["./assets/images/toolstand1.png", "./assets/images/toolstand2.png"],
    "added": "2023-04-01",
    "dateRange": "Jan 2023 — Apr 2023"
  },
  {
    "id": 12,
    "name": "Fixture Database Project",
    "organization": "Welbilt",
    "description": "Developed a database system managing 500+ fixtures with search functionality and image upload capabilities for streamlined fixture management.",
    "longDescription": "• Developed a database system that processes input from 500+ fixtures stored in an Excel file.\n• Implemented search functionality to enable rapid location and retrieval of fixture information.\n• Integrated image upload capability with dedicated interface controls for visual fixture identification.\n• Designed a user-friendly interface for accessing comprehensive fixture data and associated images.",
    "stars": 3,
    "tags": ["database","excel","data-management","ui"],
    "stack": ["Excel","Database","UI Design","Data Management"],
    "repo": "https://github.com/yashpatel1314/JigsFixturesDatabase",
    "demo": null,
    "images": [],
    "added": "2025-01-01",
    "dateRange": "Mar 2023 — Apr 2023"
  },
  {
    "id": 11,
    "name": "Unit Locator Project",
    "organization": "Welbilt",
    "description": "Developed an algorithm that cross-references unit lists with prioritized units, automatically highlighting matches and flagging missing units for inventory management.",
    "longDescription": "• Developed an algorithm that cross-references unit lists with a prioritized units list.\n• Implemented highlighting functionality to identify units present on both the prioritized and master lists.\n• Created a flagging system for units on the prioritized list missing from the master list, displaying them on a separate page.\n• Organized highlighted units into 3 distinct pages based on unit type for improved categorization.\n• Automated calculation of total quantities for each unit type on a separate Excel sheet for inventory tracking.",
    "stars": 3,
    "tags": ["excel","algorithm","inventory","data-processing"],
    "stack": ["Excel","VBA","Data Processing","Algorithm"],
    "repo": "https://github.com/yashpatel1314/UnitLocator",
    "demo": null,
    "images": [],
    "added": "2025-01-01",
    "dateRange": "Jan 2023 — Feb 2023"
  },
  {
    "id": 2,
    "name": "Automated Forklift Prototype",
    "organization": "University of Waterloo",
    "description": "Constructed an autonomous forklift prototype using EV3 robotics, RobotC programming, and 3D printed components with automated object detection.",
    "longDescription": "• Constructed an autonomous forklift prototype using EV3 robotics and RobotC programming.\n• Created detailed flowcharts to map out robot path planning strategies.\n• Implemented automatic object detection and lifting logic algorithms.\n• Programmed autonomous behaviors using RobotC for complete system automation.\n• Integrated EV3 mechanics with 3D printed components for stable operation.\n• Designed forklift system to autonomously lift, hold, and drop objects at designated checkpoints.",
    "stars": 4,
    "tags": ["robotc","ev3","automation","3d-printing"],
    "stack": ["RobotC","EV3","3D Printing"],
    "repo": "https://github.com/yashpatel1314/Final-Robot",
    "demo": null,
    "images": ["./assets/images/robot1.png", "./assets/images/robot2.png","./assets/images/robot3.png","./assets/images/robot4.png"],
    "added": "2022-12-01",
    "dateRange": "Sept 2022 — Dec 2022"
  },
  {
    "id": 3,
    "name": "Traffic Light System",
    "organization": "Westlane Secondary School",
    "description": "Developed an Arduino-based 4-way intersection traffic control system with crosswalk functionality and train detection capabilities.",
    "longDescription": "• Developed an Arduino-based traffic light system that simulates a 4-way stop intersection with crosswalk and train functionality.\n• Designed and implemented a complete 4-way intersection traffic control system.\n• Integrated crosswalk functionality with dedicated pedestrian signals.\n• Implemented train detection and warning system for enhanced safety.\n• Programmed traffic light sequencing logic using Arduino.\n• Fabricated physical structure using cardboard and scrap materials (excluding wiring and LEDs).\n• Soldered all electrical connections and integrated system components.",
    "stars": 2,
    "tags": ["arduino","electronics","embedded"],
    "stack": ["Arduino","C++","Electronics"],
    "repo": "https://github.com/yashpatel1314/traffic_control_project",
    "demo": null,
    "images": ["./assets/images/light1.png", "./assets/images/light2.png"],
    "added": "2022-04-01",
    "dateRange": "Jan 2022 — Apr 2022"
  }
]